Диплом21_августа_новый/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>ИДЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Индикатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаСостояния</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Диплом21_августа_новый/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ObjectModule.bsl
Функция ВКМ_ЗаполнитьНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
	
	Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    ДоговорыКонтрагентов.Ссылка КАК Договор,
        |    РеализацияТоваровУслуг.Ссылка КАК Реализация
        |ИЗ
        |    Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
        |        ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
        |        ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
        |ГДЕ
        |    НЕ ДоговорыКонтрагентов.ПометкаУдаления
        |    И РеализацияТоваровУслуг.Дата = &Дата";
    
    Запрос.УстановитьПараметр("Дата", Период); 
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Выборка = РезультатЗапроса.Выбрать();
    
    ТЗ = Новый ТаблицаЗначений; 
    ТЗ.Колонки.Добавить("Договор"); 
    ТЗ.Колонки.Добавить("Реализация"); 
    
    Пока Выборка.Следующий() Цикл
        НоваяСтрока = ТЗ.Добавить();
        НоваяСтрока.Договор = Выборка.Договор; 
        НоваяСтрока.Реализация = Выборка.Реализация;
    КонецЦикла;  
    
    Для Каждого Строка Из Данные Цикл
        СтрокаТЗ = ТЗ.Найти(Строка.Договор);
        Если ЗначениеЗаполнено(СтрокаТЗ) Тогда
            Строка.Реализация = СтрокаТЗ.Реализация;
        КонецЕсли; 
	КонецЦикла; 
	
КонецФункции


//Функция ПолучитьДоговорыКонтрагентов()
//    
//    Запрос = Новый Запрос;
//    Запрос.Текст = 
//        "ВЫБРАТЬ
//        |    ДоговорыКонтрагентов.Ссылка КАК Ссылка
//        |ИЗ
//        |    Справочник.ДоговорыКонтрагентов КАК Договор
//        |ГДЕ
//        |    НЕ ДоговорыКонтрагентов.ПометкаУдаления";
//    
//    РезультатЗапроса = Запрос.Выполнить();
//    
//    Выборка = РезультатЗапроса.Выбрать();
//    
//    МассивДоговоров = Новый Массив; 
//    
//    Пока Выборка.Следующий() Цикл
//        МассивДоговоров.Добавить(Выборка.Ссылка);
//    КонецЦикла;  
//    
//    Возврат МассивДоговоров;     
//    
//КонецФункции

//Функция ВКМ_ЗаполнитьРеализацияТоваровУслугНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
//        
//    НаименованиеЗадания = "Запуск длительной операции";
//    ВыполняемыйМетод = "ВКМ_ДлительныеОперации.СозданиеРеализаций";
//    ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
//    ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
//    ПараметрыВыполнения.ЗапуститьВФоне = Истина;
//    
//    // для отладки
//    //ПараметрыВыполнения.ЗапуститьВФоне   = Ложь;
//    //ПараметрыВыполнения.ЗапуститьНеВФоне = Истина;
//    
//    МассивДанных = Новый Массив; 
//    СтруктураРеквизитов = Новый Структура("Период", Объект.Период); 
//    МассивДанных.Добавить(СтруктураРеквизитов);
//    ТЗ = Объект.Данные.Выгрузить();
//    МассивСтруктур = ТаблицаЗначенийВМассив(ТЗ);
//    МассивДанных.Добавить(МассивСтруктур); 
//    
//    ПараметрыЗапуска.Вставить("ДанныеОбъекта", МассивДанных); 
//    
//    СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, ПараметрыЗапуска.ПараметрыВыполнения, ПараметрыЗапуска.ДанныеОбъекта);
//        
//    Возврат СтруктураФоновогоЗадания;
//    
//КонецФункции  

//&НаКлиенте
//Процедура ОбработатьДанные(Результат, ЛогЗагрузки) Экспорт
//    
//    ВКМ_ЗаполнитьРеализацияТоваровУслугНаСервере(); 
//    а=1;
//    
//КонецПроцедуры

//Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт
//    
//    Массив = Новый Массив();
//    СтруктураСтрокой = "";
//    НужнаЗапятая = Ложь;
//    Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
//        Если НужнаЗапятая Тогда
//            СтруктураСтрокой = СтруктураСтрокой + ",";
//        КонецЕсли;
//        СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
//        НужнаЗапятая = Истина;
//    КонецЦикла;
//    Для Каждого Строка Из ТаблицаЗначений Цикл
//        НоваяСтрока = Новый Структура(СтруктураСтрокой);
//        ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
//        Массив.Добавить(НоваяСтрока);
//    КонецЦикла;
//    Возврат Массив;

//КонецФункции
